-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Feb 19, 2024 at 05:50 AM
-- Server version: 10.4.27-MariaDB
-- PHP Version: 8.2.0

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `anime`
--

-- --------------------------------------------------------

--
-- Table structure for table `anime`
--

CREATE TABLE `anime` (
  `id` int(11) NOT NULL,
  `name` varchar(255) DEFAULT NULL,
  `descript` text DEFAULT NULL,
  `img` varchar(255) DEFAULT NULL,
  `img2` varchar(255) NOT NULL,
  `type` varchar(50) DEFAULT NULL,
  `category` varchar(50) DEFAULT NULL,
  `episode` varchar(50) NOT NULL,
  `rating` decimal(10,2) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `anime`
--

INSERT INTO `anime` (`id`, `name`, `descript`, `img`, `img2`, `type`, `category`, `episode`, `rating`) VALUES
(1, 'Demon Slayer : Swordsmith Village Arc', 'ภายหลังจากที่ ทันจิโร่ และพรรคพวกสามารถเอาชนะอสูรข้างขึ้นที่ 6 ได้สำเร็จ พวกเขาก็ได้รับภารกิจให้เดินทางไปยังหมู่บ้านช่างตีดาบ เพื่อนำดาบของตัวเองไปซ่อมแซม แต่แล้วก็เกิดเหตุการณ์ไม่คาดฝันขึ้น เมื่ออยู่ ๆ ก็มีอสูรปริศนาบุกเข้ามาโจมตีหมู่บ้าน ทันจิโร่กับพรรคพวกจึงต้องเข้าเผชิญหน้ากับเหล่าอสูรสุดแกร่งและต่อสู้กับพวกมัน', 'https://cdn.oneesports.gg/cdn-data/2023/03/Anime_DemonSlayer_Season3_Poster.jpg', 'https://cdn.myanimelist.net/images/anime/1297/133915l.jpg', 'TV-Series', 'Action', '11 ตอน', '4.00'),
(2, 'Attack On Titan Final Season Part 2', 'เรื่องราวหลังจากที่ เอเลน เยเกอร์ ได้รับรู้ความจริงเกี่ยวกับพ่อของตัวเองอย่าง กรีชา เยเกอร์ รวมถึงเรื่องราวของราชวงศ์ที่ถือครองพลังไททัน ซึ่งนำมาสู่การต่อสู้ครั้งใหม่เพื่ออิสระภาพของเอเลนและพวกพ้อง เพียงแต่ครั้งนี้จะไม่ใช่การเผชิญหน้ากับเหล่าไททัน แต่เป็นกลุ่มมนุษย์ที่อยู่อีกฟากฝั่งของท้องทะเล', 'https://www.online-station.net/wp-content/uploads/2023/02/Attack-on-Titan-The-Final-Season-Part-1.jpg', 'https://resize.cdn.otakumode.com/ex/680.961/u/a66cf2e22dbb4066ae8dd80092fe8a48.jpg', 'TV-Series', 'Action', '12 ตอน', '5.00'),
(3, 'Itai no wa Iya nano de SS2 ', 'ฮอนโจ คาเอเดะ (เมเปิล) สาวน่ารักที่ถูกเพื่อน ชิโรมิเนะ ริสะ (แซลลี่) ชวนมาเล่นเกมในโลกเสมือนจริง VRMMO “นิวเวิร์ลด์ออนไลน์” (NewWorld Online) แล้วต้องเล่นตามลำพังก่อน แต่ด้วยอุปนิสัยที่กังวลกับการโดนโจมตี ไม่อยากเจ็บตัว จึงขอเล่นสายประหลาด อัพแต่ค่า VIT เพื่อให้ถึกยิ่งขึ้น จนศัตรูทำ Damage ไม่ได้แลกกับไม่มีพลังโจมตี แล้วยังโชคดี ด้วยการเล่นที่พิศดารกว่าคนทั่วไป ทำให้ได้สกิลแปลกที่นำมาใช้คู่กันได้ ทั้งสกิลโจมตีที่รุนแรง พิษที่ทรงพลัง จนกลายเป็นผู้เล่นระดับท็อปอย่างรวดเร็ว พร้อมสร้างความปวดหัวให้กับเหล่า GM ผู้ดูแลเกม เธอยังได้เพื่อนฝูงที่นิสัยแตกต่างกัน ก่อตั้งกิลด์ ต้นเมเปิล (Maple Tree) แล้วร่วมสำรวจเกมที่มีหลายสิ่งให้ค้นหา', 'https://www.online-station.net/wp-content/uploads/2022/10/04bofuriss2-00a.jpg', 'https://s1.zerochan.net/Itai.no.wa.Iya.nano.de.Bougyoryoku.ni.Kyokufuri.Shitai.to.Omoimasu..600.2836577.jpg', 'TV-Series', 'Action', '12 ตอน', '0.00'),
(4, 'Tokyo Revengers SS2', 'ฮินาตะ ได้ถูกสังหารโดยสมาชิกแก๊งโตเกียวมันจิไคอีกครั้ง แต่คราวนี้มันเกิดขึ้นต่อหน้า ทาเกะมิจิ และนั่นทำให้เขาได้มีโอกาสย้อนเวลากลับมาในอีกครั้งเ พื่อเปลี่ยนแปลงเหตุการณ์สำคัญทำให้เขาสามารถที่ช่วยเหลือเธอ ที่ในช่วงเวลานั้นเกิดคดีสำคัญที่เกี่ยวข้องกับโศกนาฏกรรมน่าเศร้า ที่มีชายทั้ง 6 คนเชื่อมโยงกัน และนั่นเป็นจุดกำเนิดของการก่อตั้งแก๊งโตเกียวมันจิไคนั่นเอง', 'https://img.4gamers.com.tw/news-image/5b322cb5-814c-48d1-97ab-2be23df66b26.jpg', 'https://m.media-amazon.com/images/M/MV5BYzk4NDc5MTAtZGQzOC00Y2MyLThkMGEtOGRkMzliOGNlYjkwXkEyXkFqcGdeQXVyMTA5NzUzODM4._V1_FMjpg_UX1000_.jpg', 'TV-Series', 'Action', '13 ตอน', '0.00'),
(5, 'Record Of Ragnarok SS2', 'สภาแห่งทวยเทพรวมตัวกันทุก ๆ พันปีเพื่อตัดสินชะตากรรมของมนุษยชาติ โดยตัดสินใจว่าประวัติศาสตร์อันยาวนานกว่า 7 ล้านปีของมนุษยชาติที่ไม่อาจแก้ไขได้ให้เหตุผลสำหรับการสูญพันธุ์ของพวกเขา แต่วาลคิรี Brunhilde เสนอให้มนุษย์มีโอกาสครั้งสุดท้ายในการพิสูจน์คุณค่าของตน และเหล่าทวยเทพตกลงที่จะจัดการแข่งขัน Ragnarok ซึ่งมนุษยชาติจะได้รับการไว้ชีวิตหากพวกเขาสามารถเอาชนะเหล่าทวยเทพในการแข่งขันเจ็ดในสิบสามนัด ตัวแทนของมนุษยชาติคือ เอย์นเฮริยาร์ มนุษย์ที่มีชื่อเสียงในประวัติศาสตร์ซึ่งแต่ละคนได้รับวาลคิรีซึ่งจะกลายเป็นอาวุธทรงพลังที่ปรับแต่งตามสไตล์การต่อสู้ของผู้ใช้ที่เรียกว่า “Volund” ซึ่งเสี่ยงต่อการเสียชีวิตหากผู้ใช้ถูกฆ่า', 'https://t1.blockdit.com/photos/2021/06/60db341bacc8d220658eb496_800x0xcover__-eM-8B2.jpg', 'https://cms.dmpcdn.com/moviearticle/2023/01/27/6e19b630-9e04-11ed-9641-09ac282ba362_webp_original.jpg', 'OVAs', 'Action', '15 ตอน', '0.00'),
(6, 'Jujutsu Kaisen 2nd Season', 'เนื้อเรื่องจะเล่าย้อนกลับไปถึงความเก่งกาจในสมัยเรียนของโกะโจ ซาโตรุ และ เกะโท สุงุรุ\\r\\nอิตาโดริ ยูจิ นักเรียนมัธยมปลายที่มีสมรรถภาพร่างกายสูงแต่เลี่ยงกีฬามาอยู่กลุ่มเหนือธรรมชาติ ก่อนปู่ตายได้ฝากให้เขาคิดถึงการช่วยผู้อื่นและตายอย่างเหมาะสม เขาได้มาพัวพันกับ “วัตถุต้องสาป” ที่ทำให้สัตว์ประหลาดปรากฏตัว ยูจิ และกลืนนิ้วต้องสาปเข้าไปเพื่อช่วยพวกรุ่นพี่ ถึงพลังคำสาปของนิ้วเทพอสูร เรียวเมน สุคุนะ จะมีพลังรุนแรง แต่กลับไม่สามารถควบคุมร่างเขาได้ ทำให้กลุ่มสมาคมไสยเวทตั้งใจให้เขารวบรวมนิ้วต้องคำสาปของเทพอสูรทั้งหมดรวม 20 นิ้ว (มี 4 แขน) แล้วค่อยกำจัด ยูจิ ในภายหลัง ซึ่งเขายอมรับข้อเสนอนั้นเพื่อช่วยเหลือผู้คนที่อาจเดือดร้อนกับคำสาปเหล่านี้ และเข้าเรียนในโรงเรียนไสยเวทที่โตเกียว มีเพื่อนในชั้นปี 1 อีกสองคน คือ เมกุมิ และ โนบาระ', 'https://images.immediate.co.uk/production/volatile/sites/3/2023/05/JujutsuKaisenS2BaseAssets16x93840x2160-Cropped-dba19e6.png?quality=90&resize=980,654', 'https://a.storyblok.com/f/178900/2000x3000/8863dbd7c8/jujutsu-kaisen-season-2-key-art.png/m/filters:quality(95)format(webp)', 'TV-Series', 'Action', '23 ตอน', '0.00'),
(7, 'Tensei shitara Slime Datta Ken SS2', 'เนื้อเรื่องจะว่าด้วยชายโสดวัย 37 “มิคามิ ซาโตรุ” ผู้ถูกโจรวิ่งราวเอามีดแทงเสียชีวิต ก่อนมาเกิดเป็น “ริมูรุ เทมเพสต์” ตัวสไลม์ในต่างโลก ซึ่งความพิเศษของสไลม์ที่ดูจะกากกื๋อนี้ก็คือนอกจากปรับเปลี่ยนรูปร่างได้ตามใจนึกแล้ว หากเขมือบอะไรเข้าไปก็จะได้รับความสามารถเฉพาะของสิ่งมีชีวิตชนิดนั้นมาด้วย กระทั่งหลังออกผจญภัยมาเรื่อยๆ เจ้าตัวก็ได้ผู้ติดตามมากขึ้นจนได้รับการสถาปนาขึ้นเป็นผู้นำ พร้อมๆ กับการก่อตั้งประเทศตัวเองอย่าง “สมาพันธ์มอนสเตอร์จูร่า เทมเพสต์” ขึ้นมาในที่สุด', 'https://www.online-station.net/wp-content/uploads/2021/09/02tenslime-00a.jpg', 'https://wiki.anime-os.com/image/2019/03/TenSura-Season-2.jpg', 'TV-Series', 'Fantasy', '12 ตอน', '5.00'),
(8, 'Mushoku Tensei Isekai Ittara Honki Dasu 2nd ', 'ชายอายุ 34 ซิง ไม่มีงานทำและเป็นฮิคิโคโมริได้ถูกรถชนและเสียชีวิต…ทั้งที่ควรจะเป็นแบบนั้น ในตอนที่ผู้ชายลืมตาตื่นขึ้นมาอีกครั้ง ก็พบว่าที่แห่งนั้นคือโลกแห่งดาบและเวทมนตร์ไปเสียแล้ว ชายผู้กลับชาติมาเกิดใหม่ในฐานะเด็กหนุ่ม รูเดียสคิดว่าถ้าเป็นโลกนี้ตัวเองก็อาจจะใช้ชีวิตอย่างจริงจังได้ก็ได้', 'https://image.tmdb.org/t/p/original/rDFrIVWt6GlvtzFhnN7PjD84Tyz.jpg', 'https://i0.wp.com/www.otakupt.com/wp-content/uploads/2022/12/Mushoku-Tensei-Jobless-Reincarnation-2-Rudeus-1.jpg?resize=768%2C1090&ssl=1', 'TV-Series', 'Fantasy', '12 ตอน', '4.00'),
(9, 'Dr.Stone: New World (Season 3)', 'มวลมนุษยชาติถูกแสงสีเขียวตกใส่ทำให้กลายเป็นหินหลายพันปี อารยธรรมโลกสมัยใหม่ถดถอยกลับสู่ยุคดึกดำบรรพ์ 3700 ปีให้หลัง อิชิคามิ เซ็นคู ตัวเอกของเรื่องได้ตื่นขึ้น เขาใช้ความรู้ทางวิทยาศาสตร์ ช่วยเหลือเหล่าเพื่อนมนุษย์บนโลกที่กลายเป็นหิน อารยธรรมใหม่กำลังจะกลับคืนสู่โลกยุคหินอีกครั้ง ดร.สโตน ซีซัน 3 ในคราวนี้เป็นการสานต่อเนื้อเรื่องจากซีซัน 2 เป็นการผจญภัยจากบนบกสู่ทะเล เดินทางข้ามทวีปเพื่อสำรวจโลกที่ไม่รู้จัก ไปร่วมลุ้นกันว่าครั้งนี้เราจะได้พบกับความรู้วิทยาศาสตร์แบบใดจากเขากันบ้าง', 'https://staticg.sportskeeda.com/editor/2023/03/53ef8-16783601376428-1920.jpg', 'https://resize.cdn.otakumode.com/ex/680.961/u/47bf369bf66b4adf9351f5da855660f3.jpg', 'TV-Series', 'Fantasy', '11 ตอน', '0.00'),
(10, 'Vinland Saga Season 2', 'สหราชอาณาจักรในยุคสมัยโบราณ เมื่อครั้งที่แผ่นดินปกคลุมไปด้วยสายลมหนาวและหิมะ คละเคล้าไปกับกลิ่นไอของความโหดร้ายป่าเถื่อนที่แผ่ขยายไปทั่วทุกหัวระแหงจากสงครามน้อยใหญ่นับครั้งไม่ถ้วน ทอร์ฟีน บุตรแห่งโทลุส ชายผู้ที่เป็นอดีตหนึ่งในสี่ยอดขุนพลนักรบไวกิ้งผู้เก่งกาจที่สุดจนได้รับฉายาว่า “อสูรสงคราม” มีเป้าหมายหนึ่งเดียวในชีวิต คือการแก้แค้นให้กับบิดาผู้ถูกสังหารไปต่อหน้าต่อตาด้วยฝีมือของหัวหน้ากลุ่มทหารรับจ้าง อาเซรัด ทอร์ฟีน เข้าร่วมกลุ่มของอาเซรัดเพื่อบรรลุวัตถุประสงค์นั้น แต่ไม่นานนัก เขาก็ตกลงไปสู่ห้วงสงครามแย่งชิงอำนาจราชบัลลังก์ที่กำลังดำเนินไปอย่างบ้าคลั่ง', 'https://thematter.co/wp-content/uploads/2022/12/album-anime-05.jpg', 'https://cdn.vox-cdn.com/thumbor/bc3KmZN1UvpYu02-7XofAB1meFA=/1400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/22703352/vinland_saga.jpg', 'TV-Series', 'Action', '24 ตอน', '1.00'),
(11, 'Blue Lock', 'เรื่องราวของ “โยอิจิ อิซากิ” เด็กหนุ่มกองหน้าที่พึ่งผิดหวังจากการแข่ง และได้รับจดหมายจากสหพันธ์ฟุตบอลญี่ปุ่น ให้ไปร่วมแผนพัฒนากองหน้าสไตรเกอร์(Striker – ST) ระดับประเทศ ที่มีการรวมรวบนักเรียน ม.ปลาย กว่า 300 ชีวิต โดยทุกคนล้วนแล้วแต่เป็นกองหน้าทั้งหมด และใช้ชื่อแผนพัฒนานี้ว่า “BLUE LOCK (เรือนจำสีน้ำเงิน)” โยอิจิ อิซากิ ตัวเองของเราจะเอาชนะเพื่อนร่วมรุ่นกว่า 299 คน และก้าวขึ้นเป็น สไตรเกอร์ ระดับแนวหน้าเพื่อปฏิวัติวงการฟุตบอลญี่ปุ่นได้หรือไม่', 'https://www.online-station.net/wp-content/uploads/2021/10/05bluelock-00a-1024x538.jpg', 'https://i.pinimg.com/originals/87/0d/9b/870d9b29f868047942754af38b5aa79a.jpg', 'TV-Series', 'Sport', '24 ตอน', '0.00'),
(12, 'My Dress-Up Darling', 'โกโจ วากานะ หนุ่มมัธยมปลายที่ชอบเรื่องการเย็บเสื้อผ้าสำหรับตุ๊กตา เข้าสังคมคนอื่นยาก จนพบ คิตะกาวะ มาริน สาวแกลที่ดูตรงข้ามกับเขา เธอต้องการให้เขาช่วยตัดเย็บชุดคอสเพลย์ให้เธอ ทำให้ทั้งสองเริ่มสนิทกันมากขึ้น', 'https://news.dexclub.com/wp-content/uploads/2022/02/Kisekoi-Anime-Thumb.jpg', 'https://www.gonagaiworld.com/wp-content/uploads/2022/09/my-dress-up-darling-libro-commemorativo.jpg', 'TV-Series', 'Romantic', '12 ตอน', '0.00'),
(13, 'Kage no Jitsuryokusha ni Naritakute!', 'หนุ่มญี่ปุ่นที่หลงใหลการเป็นตัวละครปราบคนชั่วในคราบคนธรรมดา จนคิดได้ว่าชีวิตจริงไม่มีวันทำได้ เขาได้มีโอกาสไปเกิดใหม่ในต่างโลกเป็นบุตรของพวกขุนนางชื่อ ซิด ทำตามความตั้งใจเดิมที่ไม่อยากเด่น ก่อนกลายเป็นผู้นำกลุ่ม ชาโดว์การ์เดน คอยกำจัดลัทธิผู้ชั่วร้าย เรื่องซีเรียสปนกาวของหนุ่มช่างฝันได้เริ่มขึ้น', 'https://anime.atsit.in/th/wp-content/uploads/2022/12/e0b8a7e0b8b1e0b899e0b897e0b8b5e0b988e0b980e0b89ce0b8a2e0b981e0b89ee0b8a3e0b988-the-eminence-in-shadow-season-2-kage-no-jitsuryokusha-ni-naritakute-e0b88b.jpg', 'https://u.livechart.me/anime/10432/poster_image/b22d48c7916749bfbbdaba4785da3c85.jpg/large.jpg', 'TV-Series', 'Action', '20 ตอน', '0.00'),
(14, 'I\'m the Villainess, So I\'m Taming the Final Boss', 'ไอลีน คุณหนูสายสตรอง ถูกองค์รัชทายาทถอนหมั้นต่อหน้าประชาชี จึงระลึกได้ว่าตนกลับมาเกิดในโลกเกมจีบหนุ่มที่ติดงอมแงมในชาติก่อน ทั้งที่รู้แก่ใจว่าหากปล่อยไปตามเกม ตนจะต้องจบเห่เอวังแน่นอน แต่อนิจจา ความจำดันกระท่อนกระแท่นจนไม่รู้จะไปทางไหนดี!! ยังไงก็ต้องหลีกหนีจากแบดเอนด์ให้ได้ ในเมื่อเป็นแบบนี้ ก็เต๊าะลาสต์บอสมันซะเลยแล้วกัน!?', 'https://image.tmdb.org/t/p/original/9kwmwW7TnG7yjrlqbZgp8hGK9M7.jpg', 'https://i0.wp.com/akibatan.com/wp-content/uploads/2022/03/im-the-villainess-so-im-taming-the-final-boss-previews-main-cast-in-first-promo-video-01.jpg?ssl=1', 'TV-Series', 'Romantic', '12 ตอน', '0.00'),
(15, 'Summer Time Render ', 'หลังจากที่พ่อแม่ของเขาเสียชีวิต อาจิโร อาศัยอยู่กับพี่น้อง มิโอะ และ อุชิโอะ แต่หลังจากนั้นเขาก็ย้ายไปอาศัยอยู่ด้วยตัวเองในโตเกียว แต่หลังจากที่อุชิโอะจมน้ำตายขณะพยายามช่วยชิโอริ โคบายาคาวะหนุ่ม เขากลับบ้านเพื่อไว้อาลัยต่อการจากไปของเธอ อย่างไรก็ตาม รอยฟกช้ำรอบคอของอุชิโอะทำให้สาเหตุการตายของเธอถูกตั้งคำถาม\\n\\nเมื่อย้อนกลับไป ชินเปย์เชื่อว่าต้องมีคำอธิบายอื่น สิ่งที่เป็นอันตรายอยู่ท่ามกลางชาวเกาะ และนิมิตของอุชิโอะผู้ล่วงลับขอให้เขา “ช่วยมิโอะ” เป็นคำขอสุดท้ายของเธอ เขามั่นใจว่ามีบางอย่างกำลังคืบคลาน และการตายของอุชิโอะเป็นเพียงเศษเสี้ยวของปริศนา\\n\\nด้วยความช่วยเหลือจากมิโอะและคนอื่นๆ อีกหลายคน ชินเปย์พยายามดิ้นรนเพื่อสร้างอนาคตที่เขา เพื่อน และครอบครัวจะมีชีวิตอยู่ได้ แต่ยิ่งเขาสืบสวนมากเท่าไหร่ อนาคตเช่นนี้ก็ยิ่งเป็นไปไม่ได้ ความมืดมิดนี้แทรกซึมเข้าไปในเกาะบ้านเกิดของเขา เขาจะต้องทนทุกข์อีกสักเพียงใดก่อนที่จะพบหนทางที่ถูกต้องที่จะรักษามันไว้ทั้งหมด', 'https://www.online-station.net/wp-content/uploads/2021/10/SummerHead-01-1.jpg', 'https://u.livechart.me/anime/10388/poster_image/54a55a60bf65a5d32f92f63367747ab3.webp/small.jpg', 'Tv-Series', 'Psychological', '25 ตอน', '0.00'),
(16, 'Kaguya-sama: Love Is War – Ultra Romantic', 'เรื่องราวในรั้วโรงเรียนของหนุ่มสาวคู่นึง โดยเด็กหนุ่มนามว่า “ชิโรกาเนะ มิยูกิ” ประธานนักเรียน ผู้ที่เรียนเก่ง โดดเด่น ดูดี และรองประธานนักเรียนสาวนามว่า “ชิโนมิยะ คางุยะ” ลูกสาวของครอบครัวเศรษฐี ผู้มีฐานะร่ำรวย แม้ว่าทั้งคู่จะมีความรู้สึกที่ดี ๆ ให้กันและกัน แต่ทั้งคู่กลับมีทิฐิสูงเกินกว่าที่จะยอมสารภาพรักกับอีกฝ่ายก่อน เพราะทั้งคู่มีความเชื่อว่าใครที่เป็นฝ่ายสารภาพรักก่อนจะเป็นฝ่ายแพ้ โดยอนิเมะเรื่องนี้จะออกแนวชิงไหวชิงพริบกันระหว่างตัวละครทั้งสอง โดยมีการวางแผนกันต่าง ๆ นา ๆ หลากหลายรูปแบบ เพื่อให้อีกฝ่ายทำการสารภาพรักก่อน', 'https://www.online-station.net/wp-content/uploads/2020/10/02-Size-1200_1200_628-6.jpg', 'https://preview.redd.it/hkz1z6c552o81.jpg?auto=webp&s=6fe9b71cd8bc75d4e09ac88ad5c15fa2d6c9261e', 'TV-Series', 'Romance', '13 ตอน', '0.00'),
(17, 'Spy × Family', 'เรื่องราวของสายลับระดับเทพผู้ใช้รหัสลับนามว่า “สนธยา” ที่ได้รับภารกิจให้ไปสร้างครอบครัวเพื่อไว้สอดแนมและใกล้ชิด เดสมอนด์ หัวหน้าพรรคสามัคคีแห่งชาติภายในออสตาเนีย โดยเขาได้ก็ได้รับดูแลเด็กหญิงจากบ้านเลี้ยงเด็กกำพร้ามาเป็นลูก กับสาวที่ดูเรียบ ๆ มาเป็นภรรยา แต่เขาหารู้ไม่ว่าจริง ๆ แล้วเด็กหญิงที่เป็นลูกดันเป็นผู้มีพลังจิตอ่านใจหรือรับรู้อนาคตได้ ส่วนภรรยาก็ดันเป็นนักฆ่ามือฉมัง และครอบครัวที่ไม่ธรรมดานี้ก็พยายามปกปิดตัวตนของตัวเอง เพื่อไม่ให้อีกฝ่ายรู้ว่าจริง ๆ แล้วตัวเองธาตุแท้เป็นอย่างไร จนเกิดเรื่องป่วน ๆ ขึ้นทุกวัน', 'https://www.online-station.net/wp-content/uploads/2022/06/01spyxfamilylovely-00a.jpg', 'https://www.enjpg.com/img/2020/spy-x-family-1.jpeg', 'TV-Series', 'Action', '24 ตอน', '0.00'),
(18, 'Chainsaw Man', 'เนื้อเรื่องในภาคแรกจะพูดถึงชายหนุ่มนามว่า “เด็นจิ” ที่ชีวิตดำมืด เป็นหนี้สินที่สืบถอดมาจากพ่อ ต้องขายอวัยวะ ไม่มีที่นอน ดำดิ่งสู่ชีวิตที่ไร้ค่า โดยมีหมาปีศาจหัวเลื่อย โปจิตะ เพื่อนเพียงตนเดียว ซึ่งงานหลักของเด็กหนุ่มคือรับจ้างฆ่าปีศาจ เพื่อปลดหนี้ จนวันนึงได้ไปต่อสู้กับปีศาจตนนึงและทำให้เค้าถึงกับเสียชีวิต โปจิตะจึงได้ทำพัธสัญญารวมร่างกับเด็นจิ หลังจากกำจัดปีศาจตนนั้นสำเร็จ พระเอกของเราก็ได้เข้ารวมกับนักล่าปิศาจของทางการในสังกัดแผนก 4 ที่มี “มากิมะ” หญิงสาวผมชมพูเป็นผู้ดูแลแผนก', 'https://www.online-station.net/wp-content/uploads/2022/10/03chainsawmanharvey2022-00a.jpg', 'https://e1.pxfuel.com/desktop-wallpaper/723/775/desktop-wallpaper-metal-plate-chainsawman-denji.jpg', 'TV-Series', 'Action', '12 ตอน', '0.00'),
(19, 'Lycoris Recoil', 'วันวานแห่งความสงบสุข―เบื้องหลังวันเหล่านั้นมันมีความลับหลบซ่อนอยู่ สิ่งนั้นก็คือองค์กรปราบปรามอาชญากรรมลับ―“ดีเอ (ไดเร็คท์ แอทแทค)” และเหล่าเอเจนต์สาวของที่แห่งนั้น―“ไลโคริส” การที่วันเวลาเป็นไปด้วยความราบเรียบต้องขอบคุณพวกเธอเหล่านั้น อีลิทผู้ได้รับสมญานามว่าเป็นไลโคริสที่แข็งแกร่งที่สุดแห่งยุคสมัย นิชิคิกิ จิซาโตะ', 'https://www.โอตาคุแว่นผู้หนึ่ง.com/wp-content/uploads/2022/08/%F0%9D%97%9F%F0%9D%98%86%F0%9D%97%B0%F0%9D%97%BC%F0%9D%97%BF%F0%9D%97%B6%F0%9D%98%80-%F0%9D%97%A5%F0%9D%97%B2%F0%9D%97%B0%F0%9D%97%BC%F0%9D%97%B6%F0%9D%97%B9-Screenshots-9.png', 'https://s1.zerochan.net/Lycoris.Recoil.600.3607347.jpg', 'TV-Series', 'Action', '13 ตอน', '0.00'),
(20, ' Bocchi the Rock!', 'เรื่องราวของ “โกะโต ฮิโตริ” หรือ “โบจจิ” เด็กสาวผู้ที่มีความวิตกกังวลสูง ขี้อาย เข้าสังคมไม่เก่ง ซึ่งด้วยสาเหตุนี้เองทำให้เธอหาเพื่อนไม่ได้และใช้ชีวิตอย่างโดดเดี่ยวมาโดยตลอด วันหนึ่งเธอได้เห็นบทสัมภาษณ์ของวงดนตรีชื่อดังทางทีวี และโดนใจกับคำพูดที่ว่า “ถึงจะเป็นพวกเนิร์ดแต่ก็เปล่งประกายได้เหมือนกัน” สิ่งนั้นเองที่เป็นตัวจุดประกายให้เธออยากเล่นดนตรีเผื่อว่าจะได้มีเพื่อนเยอะขึ้น เธอได้อุทิศเวลาให้กับการเล่นกีตาร์ แต่แล้วตลอดระยะเวลาสามปีของชีวิตมัธยมต้น เธอก็ยังไม่มีเพื่อนสักคน ผลจาการที่เธอฝึกเล่นกีตาร์มาตลอดทำให้เธอเป็นเซียนกีตาร์มือฉมังเป็นตัวตนอีกด้านหนึ่งที่ไม่มีใครรู้ เธอได้เปิดช่องยูทูปโดยตั้งชื่อช่องว่า Guitarhero มีผู้ติดตามและชื่นชมมากมาย ถึงกระนั้นในชีวิตจริงเธอก็ไม่สนิทกับใครเลยนอกจากครอบครัว ด้วยเหตุนี้พอขึ้นชั้นมัธยมปลายเธอจึงมีความแน่วแน่ว่าจะหาเพื่อนและมีวงดนตรีให้ได้ จนได้พบกับ “อิจิจิ นิจิกะ” ที่เข้ามาทักทายแล้วชวนเธอให้เข้าไปช่วยเล่นกีตาร์ในวงดนตรีของเขา เนื่องจากมือกีตาร์ของวงได้ลาออกไปอย่างกระทันหัน เรื่องราวมิตรภาพของผองเพื่อนและการทำวงดนตรีจะเป็นไปอย่างไร?', 'https://www.metalbridges.com/wp-content/uploads/2023/04/Goto-Hitori-1024x576.png', 'https://c4.wallpaperflare.com/wallpaper/39/995/694/bocchi-the-rock-anime-girls-hd-wallpaper-preview.jpg', 'TV-Series', 'School', '12 ตอน', '5.00'),
(21, 'Mob Psycho 100 III', 'หลังจากทำลายแผนการที่คุกคามโลกแล้ว ชิเงโอะ \\\"ม็อบ\\\" คาเงยามะก็กลับมาเพื่อจัดการกับแง่มุมที่เหนื่อยล้าของชีวิตทางโลกของเขา โดยเริ่มจากการกรอกแบบฟอร์มอาชีพที่ทำให้เครียดที่โรงเรียนของเขา ในขณะเดียวกัน เขายังคงช่วยเหลือ Arataka Reigen ที่ปรึกษาของเขาและ Katsuya Serizawa พนักงานใหม่ของบริษัทในการไขคดีอาถรรพณ์ของลูกค้า ในขณะที่ทำหน้าที่ของเขาต่อไป ม็อบยังทำงานเพื่อให้ได้มาซึ่งความเป็นอิสระในชีวิตมนุษย์และเอสเปอร์ของเขามากขึ้น เช่นเดียวกับการพยายามรวมเข้ากับผู้คนรอบตัวเขาได้ดีขึ้น', 'https://img-prod.api-onscene.com/cdn-cgi/image/format=auto%2Cwidth=1600%2Cheight=900/https://sls-prod.api-onscene.com/partner_files/trueidintrend/334171/Mob%20Psycho%20100%20III%20tw2_0.jpg', 'https://honeysanime.com/wp-content/uploads/2018/12/Mob-psycho-100-season-2-300x444.png', 'TV-Series', 'Action', '12 ตอน', '0.00'),
(22, 'BOKU NO HERO ACADEMIA SS 6', 'เรื่องราวของเด็กหนุ่มผู้ไร้อัตลักษณ์ มิโดริยะ อิซึคุ ที่ฝันอยากจะเป็นฮีโรเหมือนกับ ออลไมท์ แม้ไม่มีอัตลักษณ์ ไร้พลัง มิโดริยะ ก็ไม่เคยย่อท้อ พยายามที่จะเป็นฮีไรให้ได้ จนวันนึงเขาเอาชีวิตเข้าไปเสี่ยงเพื่อช่วยชีวิต บาคุโก คัตสึกิ ที่โดน วิลเลิน จับตัว ก่อนที่ ออลไมท์ จะมาช่วย ด้วยความกล้าหาร ออลไมท์ มอบพลังให้กับ มิโดริยะ นี้คือจุดเริ่มต้นของการเป็นฮีไรของเขา พร้อมกับการเข้าโรงเรียนมัธยมปลายยูเอ เพื่อพัฒนาสู่การเป็นฮีโร่', 'https://thethaiger.com/th/wp-content/uploads/2022/07/AcademiaHead.jpg', 'https://picfiles.alphacoders.com/590/thumb-590958.jpg', 'TV-Series', 'Action', '25 ตอน', '0.00'),
(23, 'Gintama The Final ', 'ชากาตะ กินโทกิ อดีตนักรบซามูไรที่เปิดร้านรับจ้างสารพัดเพื่อหาเลี้ยงตัวเองโดยในเนื้อเรื่องนี้จะเป็นการพูดถึงการล่มสลายของโลก กินโทกิ, ทาคาสุงิ, คาซึระ ที่เคยเป็นพันธมิตรกันมาก่อนต่างก็มีความรู้สึกอยู่ในใจและผู้ที่ยืนอยู่เบื้องหน้าพวกเขา คืออาจารย์ผู้สั่งสอนและอีกบุคลิกหนึ่งของโยชิกะ โชโย อุทสึโระ เพื่อคุ้มกันพวกกินโทกิ ชินปาจิ, คางุระ, ชินเซ็นกุมิ และผู้คนในคาบุกิโจ หรือแม้กระทั่งพวกอดีตคู่แข่งต่างก็เข้าร่วมการต่อสู้เพื่อเอาประเทสแห่งซามูไรกลับมา', 'https://www.nylonthailand.com/wp-content/uploads/2022/01/IMG_9398.png', 'https://m.media-amazon.com/images/M/MV5BNWZkMjk4MTUtZDlkZC00YTViLWE4YTYtYWU3YjgyZmQ5MWU5XkEyXkFqcGdeQXVyMTA3MDk2NDg2._V1_.jpg', 'Movie', 'Action', '1 ตอน', '0.00'),
(24, 'Bleach: Thousand-Year Blood War Arc', 'คุโรซากิ อิจิโกะ เด็กมัธยมปลายที่สามารถมองเห็นวิญญาณได้วันหนึ่งเขาได้พบกับ คุจิกิ ลูเคีย ยมทูตสาวที่กำลังไล่ล่าวิญญาณปีศาจร้ายอยู่ ต่อมาลูเคียเสียทีต่อฮอลโล่จึงต้องถ่ายพลังทั้งหมดให้กับอิจิโกะ ทำให้อิจิโกะต้องรับหน้าที่เป็นยมทูตนับแต่นั้นและต้องผ่านการต่อสู้มากมายที่ประเดประดังเข้ามา และในซีวั่นนี้ก็ถือเป็นบทสุดท้ายของ Bleach ที่ยังไม่ได้ถูกนำมาสร้างเป็นอนิเมะ หลังภาค Lost Agent arc หรือ Fullbringer จบลงไปเมื่อปี 2012 เรียกว่าเป็นการฉลองครบรอบ 20 ปีของ ซีรีส์ Bleach ที่ยิ่งใหญ่สุด ๆ ไปเลยทีเดียว', 'https://d.newsweek.com/en/full/1956752/bleach.jpg', 'https://preview.redd.it/26wuoujju9681.jpg?auto=webp&s=0413a3151b6b5dbf01eb1771fd43e44ad781c54f', 'TV-Series', 'Action', '13 ตอน', '0.00'),
(25, 'Jujustu kaisen 0 The Movie ', 'เล่าเรื่องราวที่เกิดขึ้นในช่วงเวลาก่อนที่เนื้อเรื่องหลักของ Jujutsu Kaisen ในปัจจันบุนย้อนกลับไปเล่าถึง อคคตสึ ยูตะ เด็กหนุ่มที่ถูกคำสาปของเพื่อนสมัยเด็กรบกวนการใช้ชีวิตเลยถูกโกะโจ ซาโตรุ พาเข้ามาเรียนในโรงเรียนผู้ใช้ไสยเวท ร่วมกับเพื่อนร่วมชั้นในโรงเรียนอีก 3 คน ที่ตอนนี้ในเนื้อเรื่องหลักเป็นนักเรียนปี 2 กันไปแล้ว', 'https://www.nylonthailand.com/wp-content/uploads/2022/01/jujutsukaisen0_trailerscreenshot-1030x429.png', 'https://m.thaiware.com/upload_misc/movie/2022_06/original/220608120010124.jpg', 'Movie', 'Action', '1 ตอน', '0.00'),
(26, 'Mobile Suit Gundam : The Witch From Mercury', 'เรื่องราวของโมบิลสูท กันดั้ม แม่มดจากดาวพุธ จะเกิดขึ้นในปี A.S. (Ad Stella) 122 โดยในยุคนี้เป็นยุคที่องค์กรจำนวนมากขยายขอบเขตไปยังอวกาศก่อให้เกิดพื้นที่ทางเศรษฐกิจขนาดใหญ่ ภายในความวุ่นวายของโลกนี้ ซูเลียตต้า เมอคิวรี่ (Suletta Mercury) ได้เดินทางจากดาวพุธเพื่อเข้าศึกษายัง Asticassia School of Technology โดยสถาบันแห่งนี้อยู่ภายใต้การบริหารของ Beneritt Group บริษัทยักษ์ใหญ่ที่อยู่เบื้องหลังการพัฒนา Mobile Suit', 'https://i0.wp.com/news.qoo-app.com/en/wp-content/uploads/sites/3/2023/03/QooApp_Mobile-Suit-Gundam-The-Witch-from-Mercury-S2.jpg', 'https://m.media-amazon.com/images/M/MV5BODdhYTI4YzUtYzJmNi00NWQ4LThlMjYtMzIyYTEzODBmOGQyXkEyXkFqcGdeQXVyMTM3NDc1OTM2._V1_.jpg', 'TV-Series', 'Robot', '12 ตอน', '0.00'),
(27, 'Karakai Jouzu no Takagi-san Season 3', 'ภาคต่อของอนิเมะเรื่อง ‘Karakai Jouzu no Takagi-san หรือ แกล้งนักรักนะรู้ยัง?’ ที่ได้เดินทางถึงภาคที่ 3 กันแล้ว กับเรื่องราวความรักของ ‘ทาคากิ’ สาวน้อยขี้แกล้ง และ ‘นิชิคาตะ’ พ่อหนุ่มน่ารัก กับความสัมพันธ์ของทั้งสองที่กำลังพัฒนาขึ้นเรื่อย ๆ ', 'https://cdn.otakutale.com/wp-content/uploads/2021/08/Karakai-Jouzu-no-Takagi-san-Season-3-Movie-Teased.jpg', 'https://www.anime-sm.com/wp-content/uploads/2022/18/2debe0fba902864cd4929844ed8ce7c5.jpg?v=3', 'TV-Series', 'Romantic', '12 ตอน', '0.00'),
(28, 'Jojo’s Bizarre Adventure: Stone Ocean', 'เป็นเรื่องราวของโจลีน ลูกสาวของจูทาโร่ ติดอยู่ในคุกเพราะอาชญากรรมที่เธอก่อขึ้นโดยประมาท เธอเรียนรู้วิธีใช้ขาตั้งของเธอและพยายามหลบหนีคุกในขณะที่สร้างพันธมิตร-Ermes Costello และ Foo Fighters เมื่อเธอวิ่ง เธอรู้ว่าผู้ใช้แสตนด์กำลังจ้างอาชญากรอันตรายมาฆ่าเธอ Jolyne จะสามารถตามหาเขาได้หรือไม่ และเธอเข้าใจว่าความเป็นจริงเป็นอย่างไร', 'https://jojo-news.com/wp-content/uploads/2021/11/JoJoSORoundup-1024x576.png', 'https://cdn.vox-cdn.com/thumbor/lfRuAz8stTX15zRmra_kbJ-vU4A=/0x0:1500x2132/1200x0/filters:focal(0x0:1500x2132):no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23346966/FOw7TsuXEAAWurF.jpeg', 'TV-Series', 'Adventure', '38 ตอน', '0.00'),
(29, 'Cyberpunk: Edgerunners', 'บอกเล่าเรื่องราวของ David ที่ทุกข์ทรมานจากการรังแกทุกวันในชั้นเรียนเพราะเขายากจน อยู่มาวันหนึ่ง แม่ของ David เสียชีวิตเพราะสมาชิกแก๊งบางคนทะเลาะกันรอบตัวเธอ ด้วยความหงุดหงิด เดวิดจึงติดตั้งสงครามไซเบอร์ที่แม่ของเขาซ่อนตัวจากเขา หลังจากสร้างไซเบอร์แวร์แล้ว เขารู้ว่านี่คือสงครามไซเบอร์ Sandevistan ที่ให้ความเร็วที่รวดเร็วแก่คุณ แต่บางคนอยู่หลังไซเบอร์แวร์นี้ David จะสามารถปกป้องไซเบอร์แวร์นี้และปรับตัวเข้ากับมันได้หรือไม่', 'https://www.cyberpunk.net/build/images/edgerunners/phase2/cover-desktop@1x-e6d6aaa1.jpg', 'https://flxt.tmsimg.com/assets/p22812509_b_v13_ab.jpg', 'OVAs', 'Action', '10 ตอน', '0.00'),
(30, 'Akiba Maid Sensou', 'ฤดูใบไม้ผลิปี 1999 สาวน้อยผู้ใฝ่ฝันในเมดน่ารักๆ มายังอากิฮาบาระซึ่งเต็มไปด้วยเมดหลากหลายรูปแบบ เมดคาเฟ่ที่ถูกเรียกว่าบูตะโกยะหรือเล้าหมูวันนี้ก็เปิดให้บริการ เมดใหม่แสนประหลาดที่มีทั้งแบตเตอร์ เมดชื่อดัง คนฝึกสัตว์และสิ่งมีชีวิตนอกเหนือจากอากิฮาบาระ เหวี่ยงไม้เบสบอลสีแดงสุดแรงเกิด นี่คือบันทึกการทำงานต่อสู้ของเมด แด่เจ้านายและคุณผู้หญิงทั้งหลาย', 'https://i0.wp.com/akibatan.com/wp-content/uploads/2022/08/cygames-pa-works-akiba-maid-war-anime-reveals-more-cast-october-6-debut-in-video-07.jpg?ssl=1', 'https://m.media-amazon.com/images/M/MV5BMTRjYjA3NGMtOTY5Mi00ZTRiLWI5YWEtODAxZDU3ZTFmMmIzXkEyXkFqcGdeQXVyMDc5ODIzMw@@._V1_.jpg', 'TV-Series', 'Action', '12 ตอน', '0.00'),
(44, 'NieR:Automata Ver1.1a', 'ในปี ค.ศ. 5012 เอเลี่ยนได้ปรากฎตัว ใช้เครื่องจักรมีชีวิตเข้ารุกรานมนุษย์ กลุ่มมนุษย์ที่เหลือน้อยนิดอพยพไปอยู่ดวงจันทร์ เวลาผ่านไป มนุษย์ยังล้มเหลวในการพยายามยึดโลกคืน จนถึงปี ค.ศ. 11945 มนุษย์ได้พัฒนาและส่งกลุ่มแอนดรอยด์กลุ่มหนึ่งที่ล้ำสมัยรวมถึงพวก 2B, 9S มายังโลกเพื่อชิงผืนดินคืนจากพวกเอเลี่ยน', 'https://www.escapistmagazine.com/wp-content/uploads/2023/07/Nier-Automata-Ver1.1a-Season-Two-Teaser.jpg?fit=1200%2C675', 'https://www.anime-sugoi.com/upload/ab479360c069676cd00c45925915ff5d.jpg', 'TV-Series', 'Action', '12 ตอน', '0.00'),
(45, 'One Piece Film: Red', '“อูตะ” นักร้องสาวที่มีผู้คนที่รักมากที่สุดในโลก เธอร้องโดยที่ปกปิดตัวตนที่แท้จริงมาตลอด แต่ทว่าเธอจะปรากฏตัวต่อหน้าสาธารณชนเป็นครั้งแรกในงานแสดงคอนเสิร์ตที่กำลังจะจัดขึ้น เมื่อสถานที่จัดงานเต็มไปด้วยแฟนๆ ของอูตะ แม้กระทั่งเหล่าโจรสลัดที่ต่างก็มากันมากหน้าหลายตา กองทัพเรือจึงจับตาเฝ้าระวังอย่างใกล้ชิด และกลุ่มหมวกฟางที่นำโดยลูฟี่ก็มาเพลิดเพลินกับเสียงอันไพเราะในงานแสดงสดของเธอด้วยเช่นกัน เสียงที่คนทั้งโลกรอคอยก็ดังขึ้น เรื่องราวเริ่มที่น่าตกใจว่าเธอคือ ลูกสาวของสี่จักรพรรดิผมแเดง “แชงค์”', 'https://anime.atsit.in/th/wp-content/uploads/2022/07/e0b895e0b8b1e0b8a7e0b8ade0b8a2e0b988e0b8b2e0b887e0b8a0e0b8b2e0b89ee0b8a2e0b899e0b895e0b8a3e0b98c-one-piece-film-red-e0b884e0b8a3e0b8b1e0b989.png', 'https://www.anime-sugoi.com/upload/191f91f902ffb1970adf363b92622183.jpg', 'Movie', 'Action', '1 ตอน', '0.00'),
(46, 'Tensei shitara Slime Datta Ken Movie Guren no Kizuna-hen ', 'เมื่อประเทศ \"ราจะ\" ​ เจอ​ วิกฤตจากภัยพิบัติจากการทำเหมืองแร่ทำให้ทะเลสาปเป็นพิษ​ ราชินี​ โทวะได้ใช้ชีวิตเข้าแรกเพื่อยับยังพิษในบ่อน้ำทุกๆครั้งที่ใช้พลังราชินีโทวะต้องได้รับคำสาปกลับมาจนถึงวินาทีที่วิกฤติ​ ประเทศต้องหาทางออกเพื่อช่วยเหลือชีวิตของราชินีโทวะ​ ได้มีอัศวินเผ่า​ โอเกอร์​ นามว่า​ ฮิอิโระได้เสนอตัวไปขอความช่วยเหลือจาก​ สมาพันธ์​ จูร่า​ ที่เคยเป็นอาณาเขตการป้องครองของมังกรคลั่ง​เวโดร่า​และ มีผู้นำสมาพันธ์​จูร่าคือ​ ริมุรุ​ เทมเพส แต่ทว่าทันทีที่ฮิอิโระไปถึง เขากลับเจอเผ่าคู่อาฆาตอย่างเผ่าออคที่เคยทำลายหมู่บ้านของเขา เขาได้เขาไปโจมตีออคตัวนั้นแต่กลับมาเผ่าโอเกอร์หนุ่มได้เข้ามาห้ามเขาไว้ซึ่งคนนั้นคือนายน้อยเผ่าโอเกอร์ที่ได้ตายไปแล้ว นั้นก็คือเบนิมารุ นั้นเอง พวกริมุรุจึงได้ออกเดินทางไปยัง ราจะ เพื่อแก้คำสาปของโทวะ และช่วยเหลือทุกคนจากวิกฤตการณ์นี้ได้หรือไหม หรือนี้จึงเป็นจุดเริ่มต้นของโศกนาฏกรรม​ ของฮิอิโ​ระ​ และราชินีโทวะ กันแน่ ​', 'https://i.ytimg.com/vi/XEux0NPLorc/maxresdefault.jpg', 'https://www.anime-sugoi.com/upload/63530c1b112f737433fde85adeeda969.jpg', 'Movie', 'Action', '1 ตอน', '0.00');

-- --------------------------------------------------------

--
-- Table structure for table `comment`
--

CREATE TABLE `comment` (
  `comment_id` int(11) NOT NULL,
  `user` varchar(255) NOT NULL,
  `comment` text NOT NULL,
  `id` int(11) NOT NULL,
  `vote` decimal(10,0) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `comment`
--

INSERT INTO `comment` (`comment_id`, `user`, `comment`, `id`, `vote`) VALUES
(77, 'Mos', 'สนุกมาก', 1, '5'),
(78, 'Arthit', 'ก็ดีนะ', 1, '3'),
(79, 'Arthit', 'นุกมาก', 2, '5'),
(80, 'Raming', 'ธรรมดา', 1, '2'),
(81, 'Raming', 'ดีมาก ', 20, '5'),
(82, 'KerkChai', 'สนุกอยู่นะ', 1, '5'),
(83, 'Mos', 'น่าสนใจ', 8, '4'),
(84, 'Mos', 'ดีมาก', 1, '5'),
(85, 'พรี่บาส', 'ทำฟาร์มอยู่นั่นแหละ', 10, '1'),
(86, 'พรี่บาส', 'สนุกๆ', 7, '5');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `anime`
--
ALTER TABLE `anime`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `comment`
--
ALTER TABLE `comment`
  ADD PRIMARY KEY (`comment_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `anime`
--
ALTER TABLE `anime`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=47;

--
-- AUTO_INCREMENT for table `comment`
--
ALTER TABLE `comment`
  MODIFY `comment_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=87;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
